[
    {
        "Company": "Apple Inc.",
        "Symbol": "AAPL",
        "Price": "229.98 ",
        "Change": "+1.72 ",
        "Volume": "68,488,301",
        "URL": "https://finance.yahoo.com/quote/AAPL/",
        "Description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; ",
        "Last_Updated": "2025-01-21 13:17:07"
    },
    {
        "Company": "Microsoft Corporation",
        "Symbol": "MSFT",
        "Price": "429.03 ",
        "Change": "+4.45 ",
        "Volume": "26,197,507",
        "URL": "https://finance.yahoo.com/quote/MSFT/",
        "Description": "Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva,",
        "Last_Updated": "2025-01-21 13:17:11"
    },
    {
        "Company": "NVIDIA Corporation",
        "Symbol": "NVDA",
        "Price": "137.71 ",
        "Change": "+4.14 ",
        "Volume": "201,188,760",
        "URL": "https://finance.yahoo.com/quote/NVDA/",
        "Description": "NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and rel",
        "Last_Updated": "2025-01-21 13:17:14"
    },
    {
        "Company": "Amazon.com, Inc.",
        "Symbol": "AMZN",
        "Price": "225.94 ",
        "Change": "+5.28 ",
        "Volume": "42,370,123",
        "URL": "https://finance.yahoo.com/quote/AMZN/",
        "Description": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, Internationa",
        "Last_Updated": "2025-01-21 13:17:16"
    },
    {
        "Company": "Meta Platforms, Inc.",
        "Symbol": "META",
        "Price": "612.77 ",
        "Change": "+1.47 ",
        "Volume": "17,280,600",
        "URL": "https://finance.yahoo.com/quote/META/",
        "Description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Fa",
        "Last_Updated": "2025-01-21 13:17:19"
    },
    {
        "Company": "Tesla, Inc.",
        "Symbol": "TSLA",
        "Price": "426.50 ",
        "Change": "+12.68 ",
        "Volume": "94,991,429",
        "URL": "https://finance.yahoo.com/quote/TSLA/",
        "Description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and ",
        "Last_Updated": "2025-01-21 13:17:22"
    },
    {
        "Company": "Broadcom Inc.",
        "Symbol": "AVGO",
        "Price": "237.44 ",
        "Change": "+8.03 ",
        "Volume": "31,196,642",
        "URL": "https://finance.yahoo.com/quote/AVGO/",
        "Description": "Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two ",
        "Last_Updated": "2025-01-21 13:17:25"
    },
    {
        "Company": "Berkshire Hathaway Inc.",
        "Symbol": "BRK-B",
        "Price": "467.95 ",
        "Change": "+5.14 ",
        "Volume": "4,582,296",
        "URL": "https://finance.yahoo.com/quote/BRK-B/",
        "Description": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses worldwide. The company provides property, casualty, life, accident, and health insurance and reinsurance; and operates ra",
        "Last_Updated": "2025-01-21 13:17:28"
    },
    {
        "Company": "Alphabet Inc.",
        "Symbol": "GOOG",
        "Price": "197.55 ",
        "Change": "+3.14 ",
        "Volume": "22,109,129",
        "URL": "https://finance.yahoo.com/quote/GOOG/",
        "Description": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services se",
        "Last_Updated": "2025-01-21 13:17:31"
    }
]